In [1]:
%matplotlib inline 

import numpy as np # imports a fast numerical programming library
import scipy as sp #imports stats functions, amongst other things
import matplotlib as mpl # this actually imports matplotlib
import matplotlib.cm as cm #allows us easy access to colormaps
import matplotlib.pyplot as plt #sets up plotting under plt
import pandas as pd #lets us handle data as dataframes

In [2]:
salaries = pd.read_csv("C:/Users/brian/Downloads/NBA_Salary_History - HistoryFormatted.csv")
salaries.head()

   YearEnd           Team          Player        Salary  BelowMin  Unnamed: 5
0     2017  Atlanta Hawks   Dwight Howard    23,180,275       NaN           1
1     2017  Atlanta Hawks    Paul Millsap    20,072,033       NaN           2
2     2017  Atlanta Hawks   Kent Bazemore    15,730,338       NaN           0
3     2017  Atlanta Hawks  Tiago Splitter     8,550,000       NaN           0
4     2017  Atlanta Hawks     Kyle Korver     5,239,437       NaN           0

In [3]:
salaries.dtypes

YearEnd        int64
Team          object
Player        object
 Salary       object
BelowMin      object
Unnamed: 5     int64
dtype: object

In [4]:
salaries.columns

Index(['YearEnd', 'Team', 'Player', ' Salary ', 'BelowMin', 'Unnamed: 5'], dtype='object')

In [5]:
salaries.columns = ['year_end', 'team', 'player', 'salary', 'below_min', 'extra']

In [6]:
salaries.head()

   year_end           team          player         salary below_min  extra
0      2017  Atlanta Hawks   Dwight Howard    23,180,275        NaN      1
1      2017  Atlanta Hawks    Paul Millsap    20,072,033        NaN      2
2      2017  Atlanta Hawks   Kent Bazemore    15,730,338        NaN      0
3      2017  Atlanta Hawks  Tiago Splitter     8,550,000        NaN      0
4      2017  Atlanta Hawks     Kyle Korver     5,239,437        NaN      0

In [7]:
salaries.dtypes

year_end      int64
team         object
player       object
salary       object
below_min    object
extra         int64
dtype: object

In [8]:
salaries['salary'].replace(regex=True,inplace=True,to_replace=r'\D',value=r'')

In [23]:
salaries['salary'] = salaries['salary'].apply(pd.to_numeric)
salaries['salary'] = salaries['salary'].fillna(0.0).astype(int)

In [25]:
salaries[salaries['salary'] > 30000000]

      year_end                 team          player    salary below_min  extra
83        2017  Cleveland Cavaliers    LeBron James  30963450       NaN      0
1830      2014   Los Angeles Lakers     Kobe Bryant  30453805       NaN      0
9443      1998        Chicago Bulls  Michael Jordan  33140000       NaN     16
9896      1997        Chicago Bulls  Michael Jordan  30140000       NaN     17

In [ ]:
drafts = pd.read_csv("C:/Users/brian/Downloads/NBA")